Repository: Guigass/glpi-pwa
Catalog: locales/*.po
Languages: pt_br

source: PWA Configuration
pt_br: Configuração PWA

source: Firebase Configuration
pt_br: Configuração Firebase

source: API Key
pt_br: Chave da API

source: Project ID
pt_br: ID do Projeto

source: Messaging Sender ID
pt_br: ID do Remetente de Mensagens

source: App ID
pt_br: ID do Aplicativo

source: VAPID Key
pt_br: Chave VAPID

source: Firebase Service Account (FCM v1)
pt_br: Conta de Serviço Firebase (FCM v1)

source: Service Account JSON File
pt_br: Arquivo JSON da Conta de Serviço

source: Upload the service account JSON file from Firebase Console
pt_br: Envie o arquivo JSON da conta de serviço do Console Firebase

source: Invalid Service Account JSON: invalid email
pt_br: JSON da Conta de Serviço inválido: e-mail inválido

source: Invalid Service Account JSON format
pt_br: Formato JSON da Conta de Serviço inválido

source: Invalid Service Account email format
pt_br: Formato de e-mail da Conta de Serviço inválido

source: PWA Identity
pt_br: Identidade PWA

source: Application Name
pt_br: Nome do Aplicativo

source: Short Name
pt_br: Nome Curto

source: Description
pt_br: Descrição

source: Language
pt_br: Idioma

source: ISO 639-1 language code (e.g., pt-BR, en-US)
pt_br: Código de idioma ISO 639-1 (ex: pt-BR, en-US)

source: Text Direction
pt_br: Direção do Texto

source: Left to Right
pt_br: Esquerda para Direita

source: Right to Left
pt_br: Direita para Esquerda

source: PWA Navigation
pt_br: Navegação PWA

source: Start URL
pt_br: URL Inicial

source: Scope
pt_br: Escopo

source: URL scope of the PWA (usually /)
pt_br: Escopo de URL do PWA (geralmente /)

source: PWA Appearance
pt_br: Aparência PWA

source: Theme Color
pt_br: Cor do Tema

source: Background Color
pt_br: Cor de Fundo

source: Display Mode
pt_br: Modo de Exibição

source: Fullscreen
pt_br: Tela Cheia

source: Minimal UI
pt_br: Interface Mínima

source: Browser
pt_br: Navegador

source: Orientation
pt_br: Orientação

source: Any
pt_br: Qualquer

source: Portrait
pt_br: Retrato

source: Landscape
pt_br: Paisagem

source: Icons
pt_br: Ícones

source: Base Icon
pt_br: Ícone Base

source: Upload a square PNG icon (minimum 512x512px). All sizes will be generated automatically.
pt_br: Envie um ícone PNG quadrado (mínimo 512x512px). Todos os tamanhos serão gerados automaticamente.

source: Available Sizes
pt_br: Tamanhos Disponíveis

source: Generated sizes
pt_br: Tamanhos gerados

source: Icon 192x192
pt_br: Ícone 192x192

source: Icon 512x512
pt_br: Ícone 512x512

source: Shortcuts
pt_br: Atalhos

source: Default Shortcuts
pt_br: Atalhos Padrão

source: Enable default GLPI shortcuts (New Ticket, My Tickets, Knowledge Base)
pt_br: Habilitar atalhos padrão do GLPI (Novo Chamado, Meus Chamados, Base de Conhecimento)

source: Open Ticket
pt_br: Abrir Chamado

source: New Ticket
pt_br: Novo Chamado

source: My Tickets
pt_br: Meus Chamados

source: Tickets
pt_br: Chamados

source: Knowledge Base
pt_br: Base de Conhecimento

source: KB
pt_br: BC

source: Custom Shortcuts
pt_br: Atalhos Personalizados

source: JSON array of custom shortcuts. Each shortcut must have: name, url. Optional: short_name, icon, icon_sizes
pt_br: Array JSON de atalhos personalizados. Cada atalho deve ter: name, url. Opcional: short_name, icon, icon_sizes

source: Advanced
pt_br: Avançado

source: Categories
pt_br: Categorias

source: Edge Side Panel Width
pt_br: Largura do Painel Lateral do Edge

source: Preferred width for Edge Side Panel (0 to disable)
pt_br: Largura preferida para o Painel Lateral do Edge (0 para desabilitar)

source: Related Application URL
pt_br: URL do Aplicativo Relacionado

source: URL to a related web application manifest
pt_br: URL para um manifesto de aplicativo web relacionado

source: Prefer Related Applications
pt_br: Preferir Aplicativos Relacionados

source: Prefer related applications over this PWA
pt_br: Preferir aplicativos relacionados a este PWA

source: Save
pt_br: Salvar

source: Send Test Notification
pt_br: Enviar Notificação de Teste

source: Invalid PWA configuration. Please check your inputs
pt_br: Configuração PWA inválida. Por favor, verifique suas entradas

source: Settings saved successfully
pt_br: Configurações salvas com sucesso

source: Error validating settings
pt_br: Erro ao validar configurações

source: Invalid security token
pt_br: Token de segurança inválido

source: Icon base: File exceeds upload_max_filesize directive
pt_br: Ícone base: Arquivo excede a diretiva upload_max_filesize

source: Icon base: File exceeds MAX_FILE_SIZE directive
pt_br: Ícone base: Arquivo excede a diretiva MAX_FILE_SIZE

source: Icon base: File was only partially uploaded
pt_br: Ícone base: Arquivo foi apenas parcialmente enviado

source: Icon base: No file was uploaded
pt_br: Ícone base: Nenhum arquivo foi enviado

source: Icon base: Missing temporary folder
pt_br: Ícone base: Pasta temporária ausente

source: Icon base: Failed to write file to disk
pt_br: Ícone base: Falha ao escrever arquivo no disco

source: Icon base: A PHP extension stopped the file upload
pt_br: Ícone base: Uma extensão PHP interrompeu o envio do arquivo

source: Icon base: Unknown upload error
pt_br: Ícone base: Erro de envio desconhecido

source: Test Notification
pt_br: Notificação de Teste

source: This is a test notification from the PWA plugin
pt_br: Esta é uma notificação de teste do plugin PWA

source: Test notification sent
pt_br: Notificação de teste enviada

source: Error sending test notification
pt_br: Erro ao enviar notificação de teste

source: New Ticket #%d
pt_br: Novo Chamado #%d

source: Ticket opened by %s - Urgency: %s
pt_br: Chamado aberto por %s - Urgência: %s

source: Ticket #%d Updated
pt_br: Chamado #%d Atualizado

source: The ticket has been updated
pt_br: O chamado foi atualizado

source: New interaction on Ticket #%d
pt_br: Nova interação no Chamado #%d

source: %s commented: %s
pt_br: %s comentou: %s

source: User
pt_br: Usuário

source: New ticket opened
pt_br: Novo chamado aberto

source: %s added a comment
pt_br: %s adicionou um comentário

source: %s was added as %s
pt_br: %s foi adicionado como %s

source: The participation of %s was updated
pt_br: A participação de %s foi atualizada

source: A validation has been requested for this ticket
pt_br: Uma validação foi solicitada para este chamado

source: Validation accepted by %s
pt_br: Validação aceita por %s

source: Validation refused by %s
pt_br: Validação recusada por %s

source: Validation updated by %s
pt_br: Validação atualizada por %s

source: %s added task: %s
pt_br: %s adicionou tarefa: %s

source: An event occurred on this ticket
pt_br: Ocorreu um evento neste chamado

source: Ticket #%d - New participant
pt_br: Chamado #%d - Novo participante

source: Ticket #%d - Participant updated
pt_br: Chamado #%d - Participante atualizado

source: Ticket #%d - Validation requested
pt_br: Chamado #%d - Validação solicitada

source: Ticket #%d - Validation updated
pt_br: Chamado #%d - Validação atualizada

source: Ticket #%d - New task
pt_br: Chamado #%d - Nova tarefa

source: Ticket #%d
pt_br: Chamado #%d

source: participant
pt_br: participante

source: requester
pt_br: solicitante

source: assigned technician
pt_br: técnico atribuído

source: observer
pt_br: observador

source: Task
pt_br: Tarefa

source: Ticket #%d Closed
pt_br: Chamado #%d Fechado

source: Ticket closed by %s
pt_br: Chamado fechado por %s

source: Ticket #%d Solved
pt_br: Chamado #%d Resolvido

source: Ticket solved by %s - Awaiting validation
pt_br: Chamado resolvido por %s - Aguardando validação

source: Ticket #%d Assigned
pt_br: Chamado #%d Atribuído

source: Ticket assigned to: %s
pt_br: Chamado atribuído a: %s

source: System
pt_br: Sistema

source: Unassigned
pt_br: Não atribuído

source: GLPI PWA Token Cleanup
pt_br: Limpeza de Tokens GLPI PWA

source: Clean expired FCM tokens
pt_br: Limpar tokens FCM expirados

source: Invalid icon size
pt_br: Tamanho de ícone inválido

source: No file uploaded
pt_br: Nenhum arquivo enviado

source: File exceeds upload_max_filesize directive
pt_br: Arquivo excede a diretiva upload_max_filesize

source: File exceeds MAX_FILE_SIZE directive
pt_br: Arquivo excede a diretiva MAX_FILE_SIZE

source: File was only partially uploaded
pt_br: Arquivo foi apenas parcialmente enviado

source: Missing temporary folder
pt_br: Pasta temporária ausente

source: Failed to write file to disk
pt_br: Falha ao escrever arquivo no disco

source: A PHP extension stopped the file upload
pt_br: Uma extensão PHP interrompeu o envio do arquivo

source: Unknown upload error
pt_br: Erro de envio desconhecido

source: GD extension is not available
pt_br: Extensão GD não está disponível

source: Could not determine file type
pt_br: Não foi possível determinar o tipo de arquivo

source: Invalid file type. Only PNG images are allowed
pt_br: Tipo de arquivo inválido. Apenas imagens PNG são permitidas

source: File size exceeds 2MB limit
pt_br: Tamanho do arquivo excede o limite de 2MB

source: File size exceeds 5MB limit
pt_br: Tamanho do arquivo excede o limite de 5MB

source: Icon must be square (same width and height)
pt_br: O ícone deve ser quadrado (mesma largura e altura)

source: Icon must be at least %dx%d pixels
pt_br: O ícone deve ter pelo menos %dx%d pixels

source: Failed to generate %dx%d: %s
pt_br: Falha ao gerar %dx%d: %s

source: Failed to generate maskable icon: %s
pt_br: Falha ao gerar ícone maskable: %s

source: Failed to generate any icons
pt_br: Falha ao gerar qualquer ícone

source: Successfully generated %d icon sizes
pt_br: Gerados com sucesso %d tamanhos de ícone

source: Some errors occurred
pt_br: Alguns erros ocorreram

source: Could not create image
pt_br: Não foi possível criar a imagem

source: Could not save icon file
pt_br: Não foi possível salvar o arquivo de ícone

source: Could not create maskable image
pt_br: Não foi possível criar a imagem maskable

source: Could not create safe zone image
pt_br: Não foi possível criar a imagem da zona segura

source: Could not save maskable icon
pt_br: Não foi possível salvar o ícone maskable

source: Could not create icons directory. Check permissions
pt_br: Não foi possível criar o diretório de ícones. Verifique as permissões

source: Icons directory does not exist and could not be created
pt_br: Diretório de ícones não existe e não pôde ser criado

source: Parent directory is also not writable
pt_br: Diretório pai também não é gravável

source: Icons directory is not writable. Check permissions
pt_br: Diretório de ícones não é gravável. Verifique as permissões

source: Icons directory is not writable
pt_br: Diretório de ícones não é gravável

source: To fix this, run the following command as root
pt_br: Para corrigir isso, execute o seguinte comando como root

source: Could not load image. File may be corrupted or not a valid PNG
pt_br: Não foi possível carregar a imagem. O arquivo pode estar corrompido ou não ser um PNG válido

source: Could not create resized image
pt_br: Não foi possível criar a imagem redimensionada

source: Could not save icon file. Check directory permissions
pt_br: Não foi possível salvar o arquivo de ícone. Verifique as permissões do diretório

source: Icon %dx%d uploaded successfully
pt_br: Ícone %dx%d enviado com sucesso

source: Icon 192x192: File exceeds upload_max_filesize directive
pt_br: Ícone 192x192: Arquivo excede a diretiva upload_max_filesize

source: Icon 192x192: File exceeds MAX_FILE_SIZE directive
pt_br: Ícone 192x192: Arquivo excede a diretiva MAX_FILE_SIZE

source: Icon 192x192: File was only partially uploaded
pt_br: Ícone 192x192: Arquivo foi apenas parcialmente enviado

source: Icon 192x192: No file was uploaded
pt_br: Ícone 192x192: Nenhum arquivo foi enviado

source: Icon 192x192: Missing temporary folder
pt_br: Ícone 192x192: Pasta temporária ausente

source: Icon 192x192: Failed to write file to disk
pt_br: Ícone 192x192: Falha ao escrever arquivo no disco

source: Icon 192x192: A PHP extension stopped the file upload
pt_br: Ícone 192x192: Uma extensão PHP interrompeu o envio do arquivo

source: Icon 192x192: Unknown upload error
pt_br: Ícone 192x192: Erro de envio desconhecido

source: Icon 512x512: File exceeds upload_max_filesize directive
pt_br: Ícone 512x512: Arquivo excede a diretiva upload_max_filesize

source: Icon 512x512: File exceeds MAX_FILE_SIZE directive
pt_br: Ícone 512x512: Arquivo excede a diretiva MAX_FILE_SIZE

source: Icon 512x512: File was only partially uploaded
pt_br: Ícone 512x512: Arquivo foi apenas parcialmente enviado

source: Icon 512x512: No file was uploaded
pt_br: Ícone 512x512: Nenhum arquivo foi enviado

source: Icon 512x512: Missing temporary folder
pt_br: Ícone 512x512: Pasta temporária ausente

source: Icon 512x512: Failed to write file to disk
pt_br: Ícone 512x512: Falha ao escrever arquivo no disco

source: Icon 512x512: A PHP extension stopped the file upload
pt_br: Ícone 512x512: Uma extensão PHP interrompeu o envio do arquivo

source: Icon 512x512: Unknown upload error
pt_br: Ícone 512x512: Erro de envio desconhecido
